Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: For example, you might need to read it by polling a file descriptor.
it_it: Ad esempio, potrebbe essere necessario leggerlo interrogando un descrittore di file.

source: For example, you might want to:
it_it: Per esempio, si potrebbe voler:

source: For example:
it_it: Ad esempio:

source: For example: https://lottiefiles.com/ .
it_it: Ad esempio: https://lottiefiles.com/.

source: For example: *"change the ``bg_opa`` of ``my_button_2`` from 0 to 255 in 500 ms."*
it_it: Ad esempio: *"cambia il ``bg_opa`` di ``my_button_2`` da 0 a 255 in 500 ms."*

source: For example: :cpp:expr:`lv_label_set_bind_text(label, subject, "%d °C")`
it_it: Ad esempio: :cpp:expr:`lv_label_set_bind_text(label, subject, "%d °C")`

source: For example: :cpp:expr:`lv_obj_add_state(widget, LV_STATE_PRESSED | LV_STATE_CHECKED)`
it_it: Ad esempio: :cpp:expr:`lv_obj_add_state(widget, LV_STATE_PRESSED | LV_STATE_CHECKED)`

source: For example: :cpp:expr:`lv_obj_set_width(slider, 100)`.
it_it: Ad esempio: :cpp:expr:`lv_obj_set_width(slider, 100)`.

source: For example: :ref:`Data binding for lv_label <lv_label_data_binding>`.
it_it: Ad esempio: :ref:`Data binding per lv_label <lv_label_data_binding>`.

source: For example: :ref:`lv_button`, :ref:`lv_slider`, :ref:`lv_dropdown`, :ref:`lv_chart`, etc.
it_it: Per esempio: :ref:`lv_button`, :ref:`lv_slider`, :ref:`lv_dropdown`, :ref:`lv_chart`, ecc.

# For example: ``"First Second Third"``.
source: For example: ``"First\nSecond\nThird"``.
it_it: Per esempio: ``"First\nSecond\nThird"``.

# For example: ``"line1 line2 line4"``
source: For example: ``"line1\nline2\n\nline4"``
it_it: Ad esempio: ``"line1\nline2\n\nline4"``

source: For example: ``Write a #ff0000 red# word``.
it_it: Ad esempio: ``Write a #ff0000 red# word``.

source: For example: ``type="axis+"``.
it_it: Ad esempio: ``type="axis+"``.

source: For example: tabs of a tabview, list of a dropdown, series of a chart, etc.
it_it: Ad esempio: tabs di una tabview, lista di una dropdown, serie di un grafico, ecc.

source: For formatted text, use :cpp:expr:`lv_arclabel_set_text_fmt(arclabel, "Formatted %s", "text")`.
it_it: Per il testo formattato, si usa :cpp:expr:`lv_arclabel_set_text_fmt(arclabel, "Formatted %s", "text")`.

source: For further details see `LVGL Pro`_.
it_it: Per ulteriori dettagli, vedere `LVGL Pro`_.

source: For further details, including how to create support for your own file system, see :ref:`file_system`.
it_it: Per ulteriori dettagli, tra cui come creare il supporto per il proprio file system, vedere :ref:`file_system`.

source: For further information, see `CSS Subgrid`_.
it_it: Per ulteriori informazioni, vedere `CSS Subgrid`_.

source: For further settings of the parent and children see the documentation of the given layout.
it_it: Per ulteriori impostazioni dell'elemento padre e degli elementi figlio, consultare la documentazione del layout in questione.

source: For host package requirements on all supported Linux distributions, see the `Required Packages for the Build Host <https://docs.yoctoproject.org/ ref-manual/system-requirements.html#required-packages-for-the-build-host>`_ section in the Yocto Project Reference Manual.
it_it: Per i requisiti dei pacchetti host su tutte le distribuzioni Linux supportate, consultare la sezione `Required Packages for the Build Host <https://docs.yoctoproject.org/ ref-manual/system-requirements.html#required-packages-for-the-build-host>`_ nello Yocto Project Reference Manual.

source: For improved readability in text editors:
it_it: Per una migliore leggibilità negli editor di testo:

source: For indexed color formats (``LV_COLOR_FORMAT_I1/2/4/8``), the palette needs to be populated for all palette indices that will be used using :cpp:expr:`lv_canvas_set_palette(canvas, index, color)`.
it_it: Per i formati di colore indicizzati (``LV_COLOR_FORMAT_I1/2/4/8``), la palette deve essere popolata per tutti gli indici di palette che verranno utilizzati tramite :cpp:expr:`lv_canvas_set_palette(canvas, index, color)`.

source: For instance, here is how it can be done on a Raspberry Pi:
it_it: Ad esempio, ecco come si può fare su un Raspberry Pi:

source: For integration with CMake, take a look at this section of the :ref:`Documentation <integrating_lvgl_cmake>`.
it_it: Per l'integrazione con CMake, consultare questa sezione della :ref:`Documentazione <integrating_lvgl_cmake>`.

source: For labels on major ticks (:cpp:enumerator:`LV_PART_INDICATOR`)
it_it: Per le etichette sulle tacche principali (:cpp:enumerator:`LV_PART_INDICATOR`)

source: For libraries like LVGL, the Kconfig system is used to configure parameters, thus avoiding direct modification of ``lv_conf.h``.
it_it: Per librerie come LVGL, il sistema Kconfig viene utilizzato per configurare i parametri, evitando così la modifica diretta di ``lv_conf.h``.

source: For main line *when it is a straight line* (:cpp:enumerator:`LV_PART_MAIN`):
it_it: Per la linea principale *quando è una linea retta* (:cpp:enumerator:`LV_PART_MAIN`):

source: For main line *when it is an arc* (:cpp:enumerator:`LV_PART_MAIN`):
it_it: Per la linea principale *quando è un arco* (:cpp:enumerator:`LV_PART_MAIN`):

source: For many ``lv_display_...()`` functions, passing NULL for the ``disp`` argument will cause the function to target the Default Display.
it_it: Per molte funzioni ``lv_display_...()``, il passaggio di NULL per l'argomento ``disp`` farà sì che la funzione utilizzi il Display di Default.

source: For more advanced use cases, the animation used internally by the image can be retrieved using :cpp:expr:`lv_animimg_get_anim(animimg)`.
it_it: Per casi d'uso più avanzati, l'animazione utilizzata internamente dall'immagine può essere recuperata utilizzando :cpp:expr:`lv_animimg_get_anim(animimg)`.

source: For more control over lighting quality, to use custom HDR images, or to share environments across multiple viewers, you can create and manage environments manually:
it_it: Per un maggiore controllo sulla qualità dell'illuminazione, per utilizzare immagini HDR personalizzate o per condividere gli ambienti tra più visualizzatori, è possibile creare e gestire gli ambienti manualmente:

source: For more detailed usage, please refer to the example code below.
it_it: Per un utilizzo più dettagliato, fare riferimento al codice di esempio riportato di seguito.

source: For more details about each feature visit that feature's dedicated documentation page.
it_it: Per maggiori dettagli su ciascuna funzionalità, visitare la pagina di documentazione dedicata.

source: For more details check out :ref:`Integration Overview <adding_lvgl_to_your_project>`.
it_it: Per maggiori dettagli consultare :ref:`Integration Overview <adding_lvgl_to_your_project>`.

source: For more details on Kconfig configuration methods, refer to the `Zephyr Kconfig documentation <https://docs.zephyrproject.org/latest/build/kconfig/setting.html>`.
it_it: Per maggiori dettagli sui metodi di configurazione di Kconfig, fare riferimento alla `documentazione Kconfig di Zephyr <https://docs.zephyrproject.org/latest/build/kconfig/setting.html>`.

source: For more details refer to the `shell documentation <https://docs.zephyrproject.org/latest/services/shell/index.html>`__.
it_it: Per maggiori dettagli, consultare la `documentazione della shell <https://docs.zephyrproject.org/latest/services/shell/index.html>`__.

source: For more details, refer to the implementation in :cpp:func:`lv_draw_sw_i1_convert_to_vtiled` in :file:`src/draw/sw/lv_draw_sw.c`.
it_it: Per maggiori dettagli, fare riferimento all'implementazione di :cpp:func:`lv_draw_sw_i1_convert_to_vtiled` in :file:`src/draw/sw/lv_draw_sw.c`.

source: For more details, see :ref:`layers`.
it_it: Per maggiori dettagli, vedere :ref:`layers`.

source: For more details, see :ref:`lv_fs_identifier_letters`.
it_it: Per maggiori dettagli, vedere :ref:`lv_fs_identifier_letters`.

source: For more details, the script used to compress the image can be found from ``lvgl/script/LVGLImage.py``.
it_it: Per maggiori dettagli, lo script utilizzato per comprimere l'immagine è disponibile in ``lvgl/script/LVGLImage.py``.

source: For more information refer to the `application development guide <https://docs.zephyrproject.org/latest/develop/application/index.html#application-configuration>`__.
it_it: Per ulteriori informazioni, consultare la `guida allo sviluppo di applicazioni <https://docs.zephyrproject.org/latest/develop/application/index.html#application-configuration>`__.

source: For more information see :ref:`lv_canvas`.
it_it: Per ulteriori informazioni, consultare :ref:`lv_canvas`.

source: For more information visit https://podman.io/docs/installation#macos
it_it: Per maggiori informazioni visitare https://podman.io/docs/installation#macos

source: For more information, check out :ref:`build_cmake`.
it_it: Per ulteriori informazioni, consultare :ref:`build_cmake`.

source: For more information, see: https://developers.google.com/speed/webp
it_it: Per ulteriori informazioni, consultare: https://developers.google.com/speed/webp

source: For more, please refer to: https://github.com/ARM-software/Arm-2D.
it_it: Per ulteriori informazioni, consultare: https://github.com/ARM-software/Arm-2D.

source: For most color formats, the alignment is 16px (except the index formats).
it_it: Per la maggior parte dei formati colore, l'allineamento è di 16 px (ad eccezione dei formati indice).

source: For newer versions of Zephyr, the OSAL (Operating System Abstraction Layer) can be utilized, which takes care of the flushing.
it_it: Per le versioni più recenti di Zephyr, è possibile utilizzare OSAL (Operating System Abstraction Layer), che si occupa del flushing.

source: For now let's understand the recipe of lvgl library.
it_it: Per ora, comprendiamo la ricetta della libreria lvgl.

source: For now, these configuration presets are available:
it_it: Per ora, sono disponibili i seguenti preset di configurazione:

source: For optimal memory usage, combine with LVGL's :ref:`image caching` feature.
it_it: Per un utilizzo ottimale della memoria, combinare con la funzione :ref:`image caching` di LVGL.

source: For other distos check out https://podman.io/docs/installation#installing-on-linux
it_it: Per altre distribuzioni, consultare https://podman.io/docs/installation#installing-on-linux

source: For partial render mode, invoke :cpp:func:`lv_st_ltdc_create_partial` like this:
it_it: Per la modalità di rendering parziale, invocare :cpp:func:`lv_st_ltdc_create_partial` in questo modo:

source: For performance reasons, the node properties are only calculated during rendering.
it_it: Per motivi prestazionali, le proprietà dei nodi vengono calcolate solo durante il rendering.

source: For performance reasons, this event is disabled by default.
it_it: Per motivi di prestazioni, questo evento è disabilitato per default.

source: For pixel engine (PE) destination, the alignment should be 64 bytes for all tiled (4x4) buffer layouts.
it_it: Per la destinazione del pixel engine (PE), l'allineamento dovrebbe essere di 64 byte per tutti i layout di buffer a mosaico (4x4).

source: For possible values see documentation of the layouts.
it_it: Per i valori possibili, consultare la documentazione dei layout.

source: For rare conditions, RLE compress may increase the file size if there's no large repetition in data.
it_it: In rare circostanze, la compressione RLE può aumentare le dimensioni del file se non ci sono grandi ripetizioni nei dati.

source: For reference, the `lv_platformio <https://github.com/lvgl/lv_platformio>`__ repository demonstrates how to set up and run LVGL on different targets, including ESP32, STM32, and a PC simulator (SDL2).
it_it: Come riferimento, il repository `lv_platformio <https://github.com/lvgl/lv_platformio>`__ mostra come configurare ed eseguire LVGL su diversi target, tra cui ESP32, STM32 e un simulatore per PC (SDL2).

source: For resource-constrained microcontroller (MCU) systems, the Nano version that requires only 3 KB Flash and 1.2 KB RAM memory resources can be tailored with easy-to-use tools.
it_it: Per i sistemi a microcontrollore (MCU) con risorse limitate, la versione Nano, che richiede solo 3 KB di memoria Flash e 1,2 KB di RAM, può essere personalizzata con strumenti di facile utilizzo.

source: For resource-rich IoT devices, RT-Thread can use the **online software package** management tool, together with system configuration tools, to achieve intuitive and rapid modular cutting, seamlessly import rich software packages; thus, achieving complex functions like Android's graphical interface and touch sliding effects, smart voice interaction effects, and so on.
it_it: Per i dispositivi IoT ricchi di risorse, RT-Thread può utilizzare lo strumento di gestione dei **pacchetti software online**, insieme agli strumenti di configurazione del sistema, per ottenere un taglio modulare rapido e intuitivo, importare senza problemi pacchetti software complessi e ottenere così funzioni complesse come l'interfaccia grafica di Android e gli effetti di scorrimento touch, gli effetti di interazione vocale intelligente e così via.

source: For simple formats:
it_it: Per i formati semplici:

source: For simplicity, there are dedicated API functions to set position and size.
it_it: Per semplicità, sono disponibili funzioni API dedicate per impostare posizione e dimensione.

source: For some LVGL applications this may not be desired or will result on poor speed of execution.
it_it: Per alcune applicazioni LVGL, questo potrebbe non essere desiderato o potrebbe comportare una scarsa velocità di esecuzione.

source: For some widgets, helper functions make it simple to connect them to subjects.
it_it: Per alcuni widget, le funzioni di supporto semplificano la connessione ai soggetti.

source: For stability in lottie animations, this author has found that they run best in the IDF when enabling :c:macro:`LV_MEM_CUSTOM` (using ``stdlib.h``)
it_it: Per quanto riguarda la stabilità delle animazioni lottie, l'autore ha scoperto che funzionano meglio nell'IDF quando si abilita :c:macro:`LV_MEM_CUSTOM` (utilizzando ``stdlib.h``)

source: For such cases there is a utility function :cpp:func:`lv_anim_speed_to_time` you can use to compute the Animation's duration, so you can set it like this:
it_it: In questi casi esiste una funzione di utilità :cpp:func:`lv_anim_speed_to_time` utilizzabile per calcolare la durata dell'animazione, quindi, la si può impostare in questo modo:

source: For such examples, simply use reStructuredText literal markup like this:
it_it: Per esempi simili, usare semplicemente il markup letterale reStructuredText in questo modo:

source: For such layers, LVGL allocates a buffer large enough to render the entire transformed area without limits.
it_it: Per tali layer, LVGL alloca un buffer sufficientemente grande da renderizzare l'intera area trasformata senza limiti.

source: For the **SD Card**, a traditional file browser can be used
it_it: Per la **SD Card**, è possibile utilizzare un file browser tradizionale.

source: For the VS Code extensions to work properly, it's recommended to open the folder in VS Code instead of opening a containing parent directory.
it_it: Affinché le estensioni di VS Code funzionino correttamente, si consiglia di aprire la cartella in VS Code anziché aprire una directory padre contenente il progetto.

source: For the ``lv_property_t * value`` argument of the :cpp:func:`lv_obj_set_property` function, the language used to call that function (e.g. in a static or dynamically-loaded library) may need additional code to convert values from their local data type (e.g. dict, table, etc.) to a C struct before passing it to the :cpp:func:`lv_obj_set_property` function.
it_it: Per l'argomento ``lv_property_t * value`` della funzione :cpp:func:`lv_obj_set_property`, il linguaggio utilizzato per chiamare tale funzione (ad esempio in una libreria statica o caricata dinamicamente) potrebbe richiedere codice aggiuntivo per convertire i valori dal loro tipo di dati locale (ad esempio, dict, table, ecc.) a una struttura C prima di passarli alla funzione :cpp:func:`lv_obj_set_property`.

source: For the best visial results, ``optional_other_full_size_buffer`` should be used if enough memory is available.
it_it: Per ottenere i migliori risultati visivi, si consiglia di utilizzare ``optional_other_full_size_buffer`` se la memoria disponibile è sufficiente.

source: For the bottom layer to be visible, the Active Screen's background has to be at least partially, if not fully, transparent.
it_it: Affinché il layer inferiore sia visibile, lo sfondo dello Schermo Attivo deve essere almeno parzialmente, se non completamente, trasparente.

source: For the darker variants of a palette color use :cpp:expr:`lv_color_t` ``c =`` :cpp:expr:`lv_palette_darken(LV_PALETTE_..., v)`.
it_it: Per le varianti più scure di un colore della tavolozza, si usa :cpp:expr:`lv_color_t` ``c =`` :cpp:expr:`lv_palette_darken(LV_PALETTE_..., v)`.

source: For the full list of style properties click :ref:`here <style_properties>`.
it_it: Per l'elenco completo delle proprietà di stile, cliccare :ref:`qui <style_properties>`.

source: For the images module to deal with files you need to add a *Driver* for the target storage system to LVGL.
it_it: Affinché il modulo immagini possa gestire i file, è necessario aggiungere un *Driver* per il sistema di archiviazione di destinazione a LVGL.

source: For the lighter variants of a palette color use :cpp:expr:`lv_color_t` ``c =`` :cpp:expr:`lv_palette_lighten(LV_PALETTE_..., v)`.
it_it: Per le varianti più chiare di un colore della tavolozza, si usa :cpp:expr:`lv_color_t` ``c =`` :cpp:expr:`lv_palette_lighten(LV_PALETTE_..., v)`.

source: For the most basic use case, subscribe to a Subject by using the following function:
it_it: Per il caso d'uso più elementare, iscriversi a un Subject utilizzando la seguente funzione:

source: For the non-generated files, only a skeleton is generated once (if the file doesn't exist).
it_it: Per i file non generati, viene creato solo uno scheletro (se il file non esiste).

source: For these cases, :cpp:expr:`lv_async_call(my_function, data_p)` can be used to call ``my_function`` on the next invocation of :cpp:func:`lv_timer_handler`.
it_it: In questi casi, :cpp:expr:`lv_async_call(my_function, data_p)` può essere utilizzata per chiamare ``my_function`` alla successiva invocazione di :cpp:func:`lv_timer_handler`.

source: For these special attributes, every widget type may have unique API functions.
it_it: Per questi attributi speciali, ogni tipo di widget può avere funzioni API univoche.

source: For this guide, we are going to setup a Docker registry container on the development host which will be accessible from any device on your LAN.
it_it: In questa guida, configureremo un "container registry Docker" sull'host di sviluppo, accessibile da qualsiasi dispositivo della LAN.

source: For this reason, LVGL provides a method for implementing custom image post-processing to address unpredicted future GPU requirements (over and above the premultiplication and stride alignment provided by :cpp:func:`lv_image_decoder_post_process`):
it_it: Per questo motivo, LVGL fornisce un metodo per implementare la post-elaborazione personalizzata delle immagini per soddisfare requisiti GPU futuri imprevisti (oltre alla premoltiplicazione e lo "stride alignment" forniti da :cpp:func:`lv_image_decoder_post_process`):

source: For this reason, execution of each LVGL function must be allowed to complete before any other LVGL function is started.
it_it: Per questo motivo, l'esecuzione di ciascuna funzione LVGL deve essere completata prima che venga avviata qualsiasi altra funzione LVGL.

source: For this reason, only one Screen and its child Widgets will ever be shown on a display at one time.
it_it: Per questo motivo, su un display verrà visualizzato solo uno Screen e i relativi Widget figli alla volta.

source: For this recipe, you will find a new folder here: ``lvgl_yocto_guide build/downloads/git2/github.com.lvgl.lvgl``.
it_it: Per questa ricetta, si troverà una nuova cartella qui: ``lvgl_yocto_guide build/downloads/git2/github.com.lvgl.lvgl``.

source: For this situation, you can use the timer-based indev read callback as usual but pause the indev timer if there hasn't been an interrupt in a while.
it_it: In questa situazione, è possibile utilizzare la callback di lettura indev basata sul timer come di consueto, ma mettere in pausa il timer indev se non si è verificato un interrupt per un po' di tempo.

source: For this, see :ref:`Gestures <indev_gestures>`
it_it: Per questo, vedere le :ref:`Gesture <indev_gestures>`

source: For tick lines (:cpp:enumerator:`LV_PART_ITEMS` and :cpp:enumerator:`LV_PART_INDICATOR`):
it_it: Per le linee delle tacche (:cpp:enumerator:`LV_PART_ITEMS` e :cpp:enumerator:`LV_PART_INDICATOR`):

source: For type names and function names, Doxygen generates a hyperlink to that code member's documentation (when it exists) with or without the single back-quotes.
it_it: Per i nomi di tipo e di funzione, Doxygen genera un collegamento ipertestuale alla documentazione di quel membro del codice (quando esiste), con o senza le virgolette inverse singole.

source: For vector graphics in general :c:macro:`LV_USE_VECTOR_GRAPHIC` also needs to be enabled.
it_it: Per la grafica vettoriale in generale, è necessario abilitare anche :c:macro:`LV_USE_VECTOR_GRAPHIC`.

source: Forcing a Refresh
it_it: Forzare un Refresh

source: Forget the touches and wait for new touch events by setting ``touch_cnt = 0`` at the end of the ``read_cb``
it_it: Ignorare i touch e attendere nuovi eventi touch impostando ``touch_cnt = 0`` alla fine di ``read_cb``

source: Fork the `lvgl repository <https://github.com/lvgl/lvgl>`__.
it_it: Eseguire il fork del repository `lvgl repository <https://github.com/lvgl/lvgl>`__.

source: Form
it_it: Formato

source: Format
it_it: Formato

source: Formatting
it_it: Formattazione

source: Former versions of imagemagick needs the imagemagick call in front of convert, identify and so on.
it_it: Le versioni precedenti di imagemagick richiedono la chiamata a imagemagick prima di convert, identify e così via.

source: Fractional scaling works using a value that is proportionally larger or smaller, e.g. ``281`` for 10% enlargement.
it_it: Il ridimensionamento frazionario funziona utilizzando un valore proporzionalmente maggiore o minore, ad esempio ``281`` per un ingrandimento del 10%.

source: Fragment
it_it: Frammento

source: Fragment Based Navigation
it_it: Navigazione Basata sui Frammenti

source: Fragment Manager is a manager holding references to fragments attached to it, and has an internal stack to achieve forward and backwards navigation.
it_it: Il Fragment Manager è un gestore che contiene i riferimenti ai frammenti ad esso associati e ha uno stack interno per consentire la navigazione in avanti e indietro.

source: Fragment is a concept copied from `Android <https://developer.android.com/guide/fragments>`__.
it_it: Il "Fragment" è un concetto copiato da `Android <https://developer.android.com/guide/fragments>`__.

source: Framework Support
it_it: Supporto del Framework

source: Frameworks like Zephyr and NuttX often cause a project to be treated like "a Zephyr project on STM32" rather than an "STM32 project running Zephyr", so their documentation is where to start.
it_it: Framework come Zephyr e NuttX spesso fanno sì che un progetto venga trattato come "un progetto Zephyr su STM32" piuttosto che come un "progetto STM32 che esegue Zephyr", quindi la loro documentazione è il punto di partenza.

source: Free HDR environment maps are widely available online.
it_it: Mappe ambientali HDR gratuite sono ampiamente disponibili online.
